       IDENTIFICATION DIVISION.
       PROGRAM-ID. pricing_engine.

       ENVIRONMENT DIVISION.
       
       DATA DIVISION.
       
       PROCEDURE DIVISION.
           STOP RUN.
       