       IDENTIFICATION DIVISION.
       PROGRAM-ID. reservation_engine.

       ENVIRONMENT DIVISION.
       
       DATA DIVISION.
       
       PROCEDURE DIVISION.
           STOP RUN.
       