       IDENTIFICATION DIVISION.
       PROGRAM-ID. ticketing_module.

       ENVIRONMENT DIVISION.
       
       DATA DIVISION.
       
       PROCEDURE DIVISION.
           STOP RUN.
       