       IDENTIFICATION DIVISION.
       PROGRAM-ID. main_page.

       ENVIRONMENT DIVISION.
       
       DATA DIVISION.
       
       PROCEDURE DIVISION.
           DISPLAY 'Log In'
           DISPLAY 'Sign Up'
           STOP RUN.

       